/*
 * @Description: 
 * @Version: 1.0
 * @Autor: hehaishen
 * @LastEditors: hehaishen
 * @Date: 2021-07-22 15:16:00
 * @LastEditTime: 2021-07-23 11:17:34
 */


/* 法治保障 */

/* 法律法规 */
let listData = [{
        "keys": 1,
        "name": "中华人民共和国行政处罚法 （2021年修正本）",
        "time": "2021-06-06"
    },
    {
        "keys": 2,
        "name": "中华人民共和国政府采购法",
        "time": "2021-05-12"
    },
    {
        "keys": 3,
        "name": "中华人民共和国安全生产法（2014年修正本）",
        "time": "2021-04-01"
    },
    {
        "keys": 4,
        "name": "广东省海上险情应急预案",
        "time": "2021-03-10"
    }];

/* 依法行政 */
let listData2 = [{
     "keys": 1,
        "name": "广州市应急管理局关于印发广州市应急救援力量参与突发事件处置补偿暂行办法的通知",
        "time": "2021-06-05"
    },
    {
         "keys": 2,
        "name": "广州市应急管理局关于废止《广州市生产经营单位安全生产“黑名单”暂行管理办法》（穗安监规字〔2016〕267 号）的通知",
        "time": "2021-05-20"
    },
    {
        "keys": 3,
        "name": "广州市应急管理局关于废止《广州市生产经营单位安全生产“黑名单”暂行管理办法》（穗安监规字〔2016〕267 号）的通知",
        "time": "2021-05-15"
    },
    {
        "keys": 4,
        "name": "广州市应急管理局 广州市财政局 广州市发展和改革委员会关于印发《广州市自然灾害救助款物使用管理办法》的通知",
        "time": "2021-04-03"
    },
    {
        "keys": 5,
        "name": "广州市应急管理局关于印发广州市安全风险分级管控实施细则（试行）的通知",
        "time": "2021-03-22"
    },
    {
        "keys": 6,
        "name": "广州市应急管理局关于印发广州市镇（街道）、园区专职安全生产监督检查员管理暂行办法的通知",
        "time": "2021-03-10"
    }];

/* 他山之石 */
let listData3 = [{
    "keys": 1,
        "name": "广州市黄埔区“05.05”道路交通一般事故",
        "time": "2021-05-05"
    },
    {
        "keys": 2,
        "name": "广州市白云区“05.03”道路交通一般事故",
        "time": "2021-05-03"
    },
    {
        "keys": 3,
        "name": "广州市番禺区沙湾镇沙湾社区居民委员会“05.01”中毒和窒息一般事故",
        "time": "2021-05-01"
    },
    {
        "keys": 4,
        "name": "广州市白云区“4.24”高处坠落一般事故",
        "time": "2021-04-24"
    },
    {
        "keys": 5,
        "name": "广州市海珠区赤岗街道“04.23”道路交通一般事故",
        "time": "2021-04-23"
    },
    {
        "keys": 6,
        "name": "花都区花东镇“04.22”道路交通一般事故",
        "time": "2021-04-22"
    }];



/* 历年突发事件总量*/

/* 近五年 */
let listData4 = [
    {
        "name": "2016",
        "value": 18
    },
    {
        "name": "2017",
        "value": 15
    },
    {
        "name": "2018",
        "value": 17
    },
    {
        "name": "2019",
        "value": 12
    },
    {
        "name": "2020",
        "value": 13
    }];

/* 近十年 */
let listData5 = [{
    "name": "2011",
    "value": 15
    },
    {
        "name": "2012",
        "value": 18
    },
    {
        "name": "2013",
        "value": 15
    },
    {
        "name": "2014",
        "value": 17
    },
    {
        "name": "2015",
        "value": 20
    },
    {
        "name": "2016",
        "value": 18
    },
    {
        "name": "2017",
        "value": 15
    },
    {
        "name": "2018",
        "value": 17
    },
    {
        "name": "2019",
        "value": 12
    },
    {
        "name": "2020",
        "value": 13
    }];



/* 历年突发事件死亡人数*/

/* 近五年 */
let listData6 = [
    {
        "name": "2016",
        "value": 25
    },
    {
        "name": "2017",
        "value": 27
    },
    {
        "name": "2018",
        "value": 22
    },
    {
        "name": "2019",
        "value": 21
    },
    {
        "name": "2020",
        "value": 15
    }];

/* 近十年 */
let listData7 = [{
    "name": "2011",
    "value": 30
},
    {
        "name": "2012",
        "value": 22
    },
    {
        "name": "2013",
        "value": 25
    },
    {
        "name": "2014",
        "value": 32
    },
    {
        "name": "2015",
        "value": 27
    },
    {
        "name": "2016",
        "value": 25
    },
    {
        "name": "2017",
        "value": 27
    },
    {
        "name": "2018",
        "value": 22
    },
    {
        "name": "2019",
        "value": 21
    },
    {
        "name": "2020",
        "value": 15
    }];

export default {
    listData,
    listData2,
    listData3,
    listData4,
    listData5,
    listData6,
    listData7
}

